docs/comp-sci/lisp/machine/i-isa.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>I-Machine Instruction Set</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">I-Machine Instruction Set</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-f1194003-5e7e-4081-b3f6-4325d1b4c155">1. Introduction</a></li>
<li><a href="#h-401ecacb-5505-4e97-8913-2d800ee91e10">2. List-Function Operations</a>
<ul>
<li><a href="#h-98dda85e-dca6-4bd3-b512-19b71bea48a4">2.1. car</a></li>
<li><a href="#h-e8dcab4f-54d1-49d4-b05b-d810b109d0f6">2.2. cdr</a></li>
<li><a href="#h-d90284a3-ff81-4c3f-a60a-7a7173bcc7ba">2.3. set-to-car</a></li>
</ul>
</li>
<li><a href="#h-ea649e86-e4bb-4287-aefc-822da69acef5">3. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-f1194003-5e7e-4081-b3f6-4325d1b4c155" class="outline-2">
<h2 id="h-f1194003-5e7e-4081-b3f6-4325d1b4c155"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-f1194003-5e7e-4081-b3f6-4325d1b4c155">
<p>
There are 211 instructions in 14 categories:
</p>

<ul class="org-ul">
<li>10 list-function</li>
<li>24 predicate</li>
<li>29 numeric</li>
<li>10 data-movement</li>
<li>8 field-extraction</li>
<li>10 array-operation</li>
<li>19 branch-and-loop</li>
<li>20 block</li>
<li>12 function-calling</li>
<li>4 binding</li>
<li>2 catch</li>
<li>24 lexical-variable-accessing</li>
<li>11 instance-variable-accessing</li>
<li>28 subprimitive.</li>
</ul>

<p>
Also note there are about 2 or 3 dozen different types of an argument.
(See, e.g., the <a href="https://tumbleweed.nu/r/lm-3/uv/chinual.html#Data-Types-1">manual</a> of a lisp machine emulator).
</p>
</div>
</div>

<div id="outline-container-h-401ecacb-5505-4e97-8913-2d800ee91e10" class="outline-2">
<h2 id="h-401ecacb-5505-4e97-8913-2d800ee91e10"><span class="section-number-2">2.</span> List-Function Operations</h2>
<div class="outline-text-2" id="text-h-401ecacb-5505-4e97-8913-2d800ee91e10">
<ol class="org-ol">
<li><code>car</code>,</li>
<li><code>cdr</code>,</li>
<li><code>doc:set-to-car</code>,</li>
<li><code>doc:set-to-cdr</code>,</li>
<li><code>doc:set-to-cdr-push-car</code>,</li>
<li><code>rplaca</code>,</li>
<li><code>rplacd</code>,</li>
<li><code>doc:rgetf</code>,</li>
<li><code>zl:member</code>,</li>
<li><code>zl:assoc</code></li>
</ol>
</div>

<div id="outline-container-h-98dda85e-dca6-4bd3-b512-19b71bea48a4" class="outline-3">
<h3 id="h-98dda85e-dca6-4bd3-b512-19b71bea48a4"><span class="section-number-3">2.1.</span> car</h3>
<div class="outline-text-3" id="text-h-98dda85e-dca6-4bd3-b512-19b71bea48a4">
<p>
Argument(s): 1,
</p>
<ul class="org-ul">
<li><code>(car &lt;dtp-list&gt;)</code> pushes the car onto the stack (a cons cell)</li>
<li><code>(car &lt;dtp-locative&gt;)</code> (a locative pointer)</li>
<li><code>(car &lt;dtp-list-instance&gt;)</code> (an object reference to a list instance)
pushes the car of the list instance onto the stack,</li>
<li><code>(car &lt;dtp-nil&gt;)</code> (primitive data type, nil) pushes nil onto the top
of the stack</li>
</ul>

<p>
If the argument is a dtp-list, then this will push the car of <code>arg</code> onto
the stack.
</p>

<p>
If the type is dtp-locative, this pushes the contents of the location
<code>arg</code> references onto the stack.
</p>

<p>
If the type of arg is dtp-nil, this pushes <code>nil</code> onto the stack.
</p>
</div>
</div>

<div id="outline-container-h-e8dcab4f-54d1-49d4-b05b-d810b109d0f6" class="outline-3">
<h3 id="h-e8dcab4f-54d1-49d4-b05b-d810b109d0f6"><span class="section-number-3">2.2.</span> cdr</h3>
<div class="outline-text-3" id="text-h-e8dcab4f-54d1-49d4-b05b-d810b109d0f6">
<ul class="org-ul">
<li><code>(cdr &lt;dtp-list&gt;)</code> pushes the cdr of the arg onto the stack</li>
<li><code>(cdr &lt;dtp-locative&gt;)</code> pushes the contents of the location arg
references onto the stack</li>
<li><code>(cdr nil)</code> pushes nil onto the stack</li>
</ul>

<p>
Post trap: Type of arg is <code>dt-list-instance</code>
</p>

<p>
Memory reference: cdr-read, then data-read
</p>

<p>
TOS Register effects: valid afer
</p>
</div>
</div>

<div id="outline-container-h-d90284a3-ff81-4c3f-a60a-7a7173bcc7ba" class="outline-3">
<h3 id="h-d90284a3-ff81-4c3f-a60a-7a7173bcc7ba"><span class="section-number-3">2.3.</span> set-to-car</h3>
<div class="outline-text-3" id="text-h-d90284a3-ff81-4c3f-a60a-7a7173bcc7ba">
<p>
Basically <code>(set-to-car arg)</code> is the same as <code>(set! arg (car arg))</code>.
</p>

<ul class="org-ul">
<li><code>(set-to-car &lt;dtp-list&gt;)</code> replaces the argument with the car of the
argument</li>
<li><code>(set-to-car &lt;dtp-locative&gt;)</code> replaces the contents of the memory
cells at location with its car</li>
</ul>
</div>
</div>
</div>


<div id="outline-container-h-ea649e86-e4bb-4287-aefc-822da69acef5" class="outline-2">
<h2 id="h-ea649e86-e4bb-4287-aefc-822da69acef5"><span class="section-number-2">3.</span> References</h2>
<div class="outline-text-2" id="text-h-ea649e86-e4bb-4287-aefc-822da69acef5">
<ul class="org-ul">
<li>I-Machine <a href="http://www.bitsavers.org/pdf/symbolics/I_Machine/I-Machine%20Architecture%20Specification.pdf">Architecture Specification</a> documents all opcodes in the
instruction set.</li>
<li>I-Machine instruction set descriptions <a href="http://www.bitsavers.org/pdf/symbolics/I_Machine/Macroinstruction_Set.pdf">PDF</a>, omits some of the
documentation.</li>
<li>I-Machine <a href="http://www.bitsavers.org/pdf/symbolics/I_Machine/Lisp-Machine_Data_Types.pdf">Data types</a></li>
<li><a href="https://hanshuebner.github.io/lmman/code.xml">Assembly Code</a> and <a href="https://hanshuebner.github.io/lmman/fd-sub.xml">Subprimitives</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-06-01 Tue 10:00.</p>
</div>
</body>
</html>